In [1]:
import pandas as pd

# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [5]:
x = pd.Series([4, 8 ,15, 16, 23, 42])

In [6]:
x

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [7]:
type(x)

pandas.core.series.Series

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable print it.

In [8]:
list1 = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
series = pd.Series(list1)

In [9]:
series

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:

Name :
Alice
Bob
Claire

Age: 
25
30
27

Gender: 
Female
Male
Female

In [10]:
data = {'Name': ['Alice', 'Bob', 'Claire'],
        'Age': [25, 30, 27],
        'Gender': ['Female', 'Male', 'Female']}

df = pd.DataFrame(data)

In [11]:
df

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

A DataFrame is a two-dimensional labeled data structure with columns of potentially different types. It is similar to a spreadsheet or a SQL table, and can be used to store and manipulate data in a variety of ways.     
A Series is a one-dimensional labeled array, ideal for single-dimensional data. It is similar to a column of data in a DataFrame, and can be used to store and manipulate data in a variety of ways.     
The main difference between DataFrames and Series is that DataFrames can store multiple columns of data, while Series can only store one column of data. Additionally, DataFrames can have columns of different types, while Series can only have columns of the same type.     
Here is an example of a DataFrame:

In [12]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})

In [13]:
df['A'][0]

1

Here is an example of a Series:

In [15]:
s = pd.Series([1, 2, 3])
s[1]

2

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Pandas provides a wide range of functions to manipulate data in a DataFrame. Here are some common functions:     
These are just a few examples, and Pandas offers many more functions for data manipulation. The choice of function depends on the specific task you want to perform on your data, such as filtering, aggregation, sorting, or merging.

In [17]:
# head()` and `tail()`**
df.head()  # Returns the first 5 rows of the DataFrame

   A  B
0  1  4
1  2  5
2  3  6

In [19]:
df.tail(10)  # Returns the last 10 rows of the DataFrame

   A  B
0  1  4
1  2  5
2  3  6

In [20]:
df.describe()  # Generates descriptive statistics of the DataFrame

         A    B
count  3.0  3.0
mean   2.0  5.0
std    1.0  1.0
min    1.0  4.0
25%    1.5  4.5
50%    2.0  5.0
75%    2.5  5.5
max    3.0  6.0

In [21]:
df.info()  # Provides a concise summary of the DataFrame, including data types and non-null values

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       3 non-null      int64
 1   B       3 non-null      int64
dtypes: int64(2)
memory usage: 176.0 bytes

In [22]:
df.shape  # Returns a tuple representing the dimensions of the DataFrame (rows, columns

(3, 2)

In [24]:
df.loc[0]  # Access a group of rows and columns by labels or a boolean array

A    1
B    4
Name: 0, dtype: int64

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

All pandas data structures are value-mutable, meaning that the values they contain can be altered. However, not all pandas data structures are size-mutable. The length of a Series cannot be changed, but, for example, columns can be inserted into a DataFrame.     
you can change the values in a Series, DataFrame, or Panel, but you can only add or remove rows and columns from a DataFrame or Panel.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [28]:
s1 = pd.Series([1, 2, 3, 4, 5])
s2 = pd.Series(['a', 'b', 'c', 'd', 'e'])
df1 = pd.DataFrame({'s1': s1, 's2': s2})
print(df1)

   s1 s2
0   1  a
1   2  b
2   3  c
3   4  d
4   5  e

As you can see, the DataFrame has two columns, s1 and s2, which correspond to the two Series that we created. The index of the DataFrame is the same as the index of the Series.     
You can also create a DataFrame using multiple Series by passing them to the DataFrame() constructor as a list. For example, the following code creates a DataFrame with the same data as the previous example:

In [31]:
ss1 = pd.Series([1, 2, 3, 4, 5])
ss2 = pd.Series(['a', 'b', 'c', 'd', 'e'])
df2 = pd.DataFrame([ss1, ss2])
print(df2)

   0  1  2  3  4
0  1  2  3  4  5
1  a  b  c  d  e

Creating a DataFrame using multiple Series can be useful when you have data that is already organized into Series. It can also be useful when you want to create a DataFrame with columns that have different data types.